tap "homebrew/bundle"
tap "koekeishiya/formulae"
brew "bat"
brew "cmake"
brew "dotnet"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "jq"
brew "mas"
brew "neovim"
brew "node"
brew "pure"
brew "rclone"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "tmux"
brew "wget"
cask "alacritty"
cask "displaylink"
cask "font-jetbrains-mono-nerd-font"
cask "gcc-arm-embedded"
cask "keycastr"
cask "sioyek"
cask "syntax-highlight"
cask "wezterm"
mas "AdGuard for Safari", id: 1440147259
mas "Brother P-touch Editor", id: 1453365242
mas "Dark Reader for Safari", id: 1438243180
mas "Ethernet Status", id: 1186187538
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "OneDrive", id: 823766827
mas "SponsorBlock", id: 1573461917
mas "Tailscale", id: 1475387142
mas "Ultrawider", id: 6473668797
mas "Userscripts-Mac-App", id: 1463298887
mas "Xcode", id: 497799835
vscode "a-h.templ"
vscode "albymor.increment-selection"
vscode "alefragnani.bookmarks"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "craigrbroughton.htmx-attributes"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "medo64.render-crlf"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tobias-z.vscode-harpoon"
vscode "tomrijndorp.find-it-faster"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
