tap "homebrew/bundle"
tap "koekeishiya/formulae"
brew "bat"
brew "cmake"
brew "dotnet"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "jq"
brew "neovim"
brew "node"
brew "pure"
brew "rclone"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "displaylink"
cask "gcc-arm-embedded"
cask "kitty"
cask "syntax-highlight"
vscode "a-h.templ"
vscode "albymor.increment-selection"
vscode "alefragnani.bookmarks"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "craigrbroughton.htmx-attributes"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "medo64.render-crlf"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tobias-z.vscode-harpoon"
vscode "tomrijndorp.find-it-faster"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
